# GetCompoundStructure Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
HostObjAttributes..::..GetCompoundStructure Method
HostObjAttributes Class See Also
---
Returns an object that represents the compound structure of the element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CompoundStructure GetCompoundStructure()
```

Visual Basic
---
```text
Public Function GetCompoundStructure As CompoundStructure
```

Visual C++
---
```text
public:
CompoundStructure^ GetCompoundStructure()
```

# Remarks
A copy of the compound structure is returned and changes made to it will not apply to the type until SetCompoundStructure is called. From this object the layers of a compound structure can be accessed. If the element does not have a compound structure then this method will return nullNothingnullptra null reference (Nothing in Visual Basic).
# See Also
HostObjAttributes Class
Autodesk.Revit.DB Namespace